servers/client-api/tests/load/script.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  # dev
  target: "https://client-api.getpocket.dev"

  # prod
  # target: "https://client-api.readitlater.com"

  plugins:
    expect: {}
    cloudwatch:
      namespace: serverless-artillery-client-api-loadtest
  phases:
    - duration: 600
      arrivalRate: 2
      rampTo: 15
      name: "Warm up client-api 15req/sec"

    - duration: 900
      arrivalRate: 15
      rampTo: 15
      name: "Sustain load 15req/sec"
  defaults:
    headers:
      Content-Type: application/json

scenarios:

  - name: "getLayout Perf test layout"
    flow:
      - post:
          url: "/"
          body: '{"query":"query get_layout{ getLayout(layoutId: \"3b064b50-5592-4030-b19a-9f05468fbbcd\") { id slates {id recommendations { itemId publisher recSrc feedId} } } }"}'
          headers:
             Content-Type: application/json
          expect:
            - statusCode: 200
            - contentType: json
#
#  - name: "getLayout Explore Career Topic Layout"
#    flow:
#      - post:
#          url: "/"
#          body: '{"query":"query get_layout{ getLayout(layoutId: \"ff23f296-6c5e-4f53-a46a-3feb5006f261\") { id slates {id recommendations { itemId publisher recSrc feedId} } } }"}'
#          headers:
#             Content-Type: application/json
#          expect:
#            - statusCode: 200
#            - contentType: json
#
#  - name: "getLayout Explore Politics Topic Layout"
#    flow:
#      - post:
#          url: "/"
#          body: '{"query":"query get_layout{ getLayout(layoutId: \"72c3878f-c48b-413c-aff8-90d7a0d79d32\") { id slates {id recommendations { itemId publisher recSrc feedId} } } }"}'
#          headers:
#             Content-Type: application/json
#          expect:
#            - statusCode: 200
#            - contentType: json